results/20k-gateway-no-ai-proxy.txt
/ # wrk -t 4 -c 400 -d 60s -R 20000 --latency -s /req-body.lua http://localhost:9080/v1/ch
at/completions
Running 1m test @ http://localhost:9080/v1/chat/completions
  4 threads and 400 connections
  Thread calibration: mean lat.: 1901.840ms, rate sampling interval: 9953ms
  Thread calibration: mean lat.: 4009.757ms, rate sampling interval: 13819ms
  Thread calibration: mean lat.: 4177.049ms, rate sampling interval: 13746ms
  Thread calibration: mean lat.: 4693.989ms, rate sampling interval: 15269ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    25.74s    10.66s   45.97s    58.64%
    Req/Sec     1.26k    27.24     1.29k    46.15%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   25.66s 
 75.000%   34.87s 
 90.000%   40.50s 
 99.000%   44.37s 
 99.900%   45.51s 
 99.990%   45.84s 
 99.999%   45.97s 
100.000%   46.01s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    6074.367     0.000000            1         1.00
   10878.975     0.100000        25005         1.11
   14884.863     0.200000        49979         1.25
   18628.607     0.300000        74889         1.43
   22134.783     0.400000        99947         1.67
   25657.343     0.500000       124820         2.00
   27557.887     0.550000       137356         2.22
   29392.895     0.600000       149783         2.50
   31129.599     0.650000       162287         2.86
   32980.991     0.700000       174758         3.33
   34865.151     0.750000       187265         4.00
   35815.423     0.775000       193579         4.44
   36732.927     0.800000       199781         5.00
   37650.431     0.825000       206077         5.71
   38600.703     0.850000       212187         6.67
   39550.975     0.875000       218485         8.00
   40042.495     0.887500       221677         8.89
   40501.247     0.900000       224706        10.00
   40992.767     0.912500       227945        11.43
   41451.519     0.925000       230997        13.33
   41943.039     0.937500       234183        16.00
   42172.415     0.943750       235741        17.78
   42401.791     0.950000       237317        20.00
   42631.167     0.956250       238900        22.86
   42860.543     0.962500       240489        26.67
   43057.151     0.968750       241852        32.00
   43188.223     0.971875       242630        35.56
   43352.063     0.975000       243400        40.00
   43548.671     0.978125       244281        45.71
   43712.511     0.981250       244947        53.33
   43941.887     0.984375       245815        64.00
   44040.191     0.985938       246165        71.11
   44171.263     0.987500       246598        80.00
   44269.567     0.989062       246911        91.43
   44400.639     0.990625       247288       106.67
   44564.479     0.992188       247723       128.00
   44630.015     0.992969       247890       142.22
   44728.319     0.993750       248114       160.00
   44793.855     0.994531       248267       182.86
   44892.159     0.995313       248481       213.33
   44990.463     0.996094       248681       256.00
   45023.231     0.996484       248745       284.44
   45088.767     0.996875       248856       320.00
   45154.303     0.997266       248959       365.71
   45219.839     0.997656       249060       426.67
   45285.375     0.998047       249152       512.00
   45318.143     0.998242       249191       568.89
   45350.911     0.998437       249232       640.00
   45416.447     0.998633       249305       731.43
   45449.215     0.998828       249342       853.33
   45514.751     0.999023       249401      1024.00
   45547.519     0.999121       249434      1137.78
   45547.519     0.999219       249434      1280.00
   45580.287     0.999316       249457      1462.86
   45613.055     0.999414       249484      1706.67
   45645.823     0.999512       249504      2048.00
   45678.591     0.999561       249527      2275.56
   45678.591     0.999609       249527      2560.00
   45711.359     0.999658       249545      2925.71
   45744.127     0.999707       249561      3413.33
   45776.895     0.999756       249577      4096.00
   45776.895     0.999780       249577      4551.11
   45776.895     0.999805       249577      5120.00
   45809.663     0.999829       249588      5851.43
   45809.663     0.999854       249588      6826.67
   45842.431     0.999878       249599      8192.00
   45842.431     0.999890       249599      9102.22
   45842.431     0.999902       249599     10240.00
   45875.199     0.999915       249606     11702.86
   45875.199     0.999927       249606     13653.33
   45907.967     0.999939       249613     16384.00
   45907.967     0.999945       249613     18204.44
   45907.967     0.999951       249613     20480.00
   45907.967     0.999957       249613     23405.71
   45907.967     0.999963       249613     27306.67
   45940.735     0.999969       249617     32768.00
   45940.735     0.999973       249617     36408.89
   45940.735     0.999976       249617     40960.00
   45940.735     0.999979       249617     46811.43
   45973.503     0.999982       249621     54613.33
   45973.503     0.999985       249621     65536.00
   45973.503     0.999986       249621     72817.78
   45973.503     0.999988       249621     81920.00
   45973.503     0.999989       249621     93622.86
   45973.503     0.999991       249621    109226.67
   45973.503     0.999992       249621    131072.00
   45973.503     0.999993       249621    145635.56
   45973.503     0.999994       249621    163840.00
   45973.503     0.999995       249621    187245.71
   45973.503     0.999995       249621    218453.33
   46006.271     0.999996       249622    262144.00
   46006.271     1.000000       249622          inf
#[Mean    =    25740.073, StdDeviation   =    10662.549]
#[Max     =    45973.504, Total count    =       249622]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  300160 requests in 1.00m, 137.97MB read
  Socket errors: connect 0, read 0, write 0, timeout 188
Requests/sec:   5002.51
Transfer/sec:      2.30MB