results/20k-gateway.txt
/ # wrk -t 4 -c 400 -d 60s -R 20000 --latency -s /req-body.lua http://localhost:9080/v1/ch
at/completions
Running 1m test @ http://localhost:9080/v1/chat/completions
  4 threads and 400 connections
  Thread calibration: mean lat.: 3434.486ms, rate sampling interval: 14032ms
  Thread calibration: mean lat.: 3438.915ms, rate sampling interval: 14032ms
  Thread calibration: mean lat.: 7779.063ms, rate sampling interval: 17760ms
  Thread calibration: mean lat.: 6137.498ms, rate sampling interval: 16383ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    30.18s    12.48s    0.88m    58.20%
    Req/Sec   649.64     27.98   690.00     54.55%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   30.59s 
 75.000%   41.09s 
 90.000%   47.05s 
 99.000%    0.86m 
 99.900%    0.88m 
 99.990%    0.88m 
 99.999%    0.88m 
100.000%    0.89m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    7696.383     0.000000            3         1.00
   12713.983     0.100000        12799         1.11
   17317.887     0.200000        25591         1.25
   21381.119     0.300000        38384         1.43
   26083.327     0.400000        51159         1.67
   30588.927     0.500000        63967         2.00
   32702.463     0.550000        70338         2.22
   34996.223     0.600000        76769         2.50
   37126.143     0.650000        83205         2.86
   39059.455     0.700000        89522         3.33
   41091.071     0.750000        95920         4.00
   42074.111     0.775000        99145         4.44
   42958.847     0.800000       102401         5.00
   43778.047     0.825000       105561         5.71
   44695.551     0.850000       108689         6.67
   45842.431     0.875000       111942         8.00
   46432.255     0.887500       113490         8.89
   47054.847     0.900000       115116        10.00
   47644.671     0.912500       116743        11.43
   48201.727     0.925000       118311        13.33
   48791.551     0.937500       119955        16.00
   49053.695     0.943750       120695        17.78
   49348.607     0.950000       121524        20.00
   49643.519     0.956250       122338        22.86
   49938.431     0.962500       123141        26.67
   50200.575     0.968750       123874        32.00
   50364.415     0.971875       124318        35.56
   50495.487     0.975000       124679        40.00
   50659.327     0.978125       125124        45.71
   50790.399     0.981250       125478        53.33
   50987.007     0.984375       125910        64.00
   51085.311     0.985938       126110        71.11
   51183.615     0.987500       126298        80.00
   51281.919     0.989062       126485        91.43
   51412.991     0.990625       126698       106.67
   51544.063     0.992188       126877       128.00
   51609.599     0.992969       126975       142.22
   51707.903     0.993750       127081       160.00
   51806.207     0.994531       127185       182.86
   51904.511     0.995313       127277       213.33
   52035.583     0.996094       127394       256.00
   52101.119     0.996484       127442       284.44
   52166.655     0.996875       127494       320.00
   52199.423     0.997266       127521       365.71
   52297.727     0.997656       127581       426.67
   52363.263     0.998047       127624       512.00
   52396.031     0.998242       127646       568.89
   52461.567     0.998437       127685       640.00
   52494.335     0.998633       127699       731.43
   52559.871     0.998828       127727       853.33
   52625.407     0.999023       127760      1024.00
   52625.407     0.999121       127760      1137.78
   52690.943     0.999219       127780      1280.00
   52723.711     0.999316       127791      1462.86
   52756.479     0.999414       127805      1706.67
   52789.247     0.999512       127812      2048.00
   52789.247     0.999561       127812      2275.56
   52822.015     0.999609       127821      2560.00
   52854.783     0.999658       127828      2925.71
   52887.551     0.999707       127837      3413.33
   52887.551     0.999756       127837      4096.00
   52920.319     0.999780       127847      4551.11
   52920.319     0.999805       127847      5120.00
   52920.319     0.999829       127847      5851.43
   52953.087     0.999854       127851      6826.67
   52985.855     0.999878       127854      8192.00
   52985.855     0.999890       127854      9102.22
   53018.623     0.999902       127858     10240.00
   53018.623     0.999915       127858     11702.86
   53051.391     0.999927       127862     13653.33
   53051.391     0.999939       127862     16384.00
   53051.391     0.999945       127862     18204.44
   53051.391     0.999951       127862     20480.00
   53084.159     0.999957       127867     23405.71
   53084.159     0.999963       127867     27306.67
   53084.159     0.999969       127867     32768.00
   53084.159     0.999973       127867     36408.89
   53084.159     0.999976       127867     40960.00
   53084.159     0.999979       127867     46811.43
   53084.159     0.999982       127867     54613.33
   53084.159     0.999985       127867     65536.00
   53084.159     0.999986       127867     72817.78
   53084.159     0.999988       127867     81920.00
   53084.159     0.999989       127867     93622.86
   53084.159     0.999991       127867    109226.67
   53116.927     0.999992       127868    131072.00
   53116.927     1.000000       127868          inf
#[Mean    =    30175.847, StdDeviation   =    12475.593]
#[Max     =    53084.160, Total count    =       127868]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  154704 requests in 1.00m, 73.92MB read
  Socket errors: connect 0, read 0, write 0, timeout 558
Requests/sec:   2578.37
Transfer/sec:      1.23MB